<?php

/**
 * Класс для интеграции с Чекопечатью Штрих ОФД
 */
class nc_payment_register_provider_shtrih extends nc_payment_register_provider {

    static protected $settings = array(
        // 'PaymentRegisterBillsFolder' => NETCAT_MODULE_PAYMENT_REGISTER_SHTRIH_BILLS_FOLDER,
        // 'PaymentRegisterKKTPrintBills' => NETCAT_MODULE_PAYMENT_REGISTER_SHTRIH_PRINT_BILLS,
    );

    static protected $shtrih_vat_enum = array(
        '' => 4,
        0 => 3,
        10 => 2,
        18 => 1,
    );
    static protected $shtrih_default_vat = 1;

    /**
     * Обработка нового чека (отправка запроса на создание чека в ККМ)
     *
     * @param nc_payment_receipt $receipt
     */
    public function process_receipt(nc_payment_receipt $receipt) {
        switch ($receipt->get('operation')) {
            case nc_payment::OPERATION_SELL:
                $operation_id = '0';
                break;
            case nc_payment::OPERATION_SELL_REFUND:
                $operation_id = '2';
                break;
            default:
                trigger_error(__METHOD__ . ': unsupported receipt operation', E_USER_WARNING);
                return;
        }

        $invoice = $receipt->get_invoice();

        $receipt_id = $receipt->get_id();
        $tax_array = array(
            'osn' => 0,
            'usn_income' => 1,
            'usn_income_outcome' => 2,
            'envd' => 3,
            'esn' => 4,
            'patent' => 5
        );
        $tax_variant = $tax_array[$this->get_setting('PaymentRegisterSN')];

        $contact_data = $invoice->get_customer_contact_for_receipt();
        $data['head'] = array(
            'head',
            1 => $receipt_id,                              // НомерЧека
            2 => $operation_id,                            // Продажа=0, Возврат Продажи=2
            3 => $contact_data,                            // ДанныеКлиента (e-mail или номер телефона, данные будут отправляться посредством средств ОФД-оператора)
            4 => 0,                                        // РежимИнтернетМагазина(1-Не печатать чек(Признак отрезки указывайте=0, 0-Печатать чек))
            5 => $contact_data,                            // Наименование клиента(строковая переменная, используется в макете)
            6 => $this->get_setting('PaymentRegisterINN'), // ИНН клиента (числовая переменная, используется в макете)
            7 => '', /* ? */                               // КПП клиента (числовая переменная, используется в макете)
            8 => 0,                                        // Пароль оператора (числовая переменная, используется в макете)
            9 => $tax_variant                              // Код налогообложения (числовая переменная от 1 до 6)
        );

        $items = $receipt->get_items();
        /** @var nc_payment_invoice_item $item */
        foreach ($items as $item) {
            $vat = nc_array_value(self::$shtrih_vat_enum, $item->get('vat_rate'), self::$shtrih_default_vat);

            // Наименование товара (не использовать символы «;» и «%», количество символов не больше 128)
            $item_name = nc_substr($item->get('name'), 0, 128);
            $item_name = strtr($item_name, ';%', ', ');

            $data['str'][] = array(
                'str',
                1 => $item_name,
                2 => $item->get('qty'),                  // Количество (Пример: «2.2232», «167», дробная часть )
                3 => $item->get('item_price'),           // Цена (1 по умолчанию, зарезервировано)
                4 => 0,                                  // Секция (Номер секции, (0..16 - режим свободной продажи, 255 - режим продажи по коду товара))
                5 => $vat,                               // Соответствие налога в ККМ (1= - НДС18%, 2 - 10%)
                6 => 0,                                  // Суммовая скидка –суммовая сидка  по данной позиции (<0-скидка, >0 надбавка)
                7 => $item->get('total_price'),          // СуммаПоПозиции - это сумма до расчета скидки
                8 => 0,                                  // Штрихкод – числовое выражение (символы от 0 до 9)
                9 => 4,                                  // Признак способа расчета – числовое выражение (символы от 1 до 7)
                10 => 1                                  // Признак предмета расчета – числовое выражение (символы от 1 до 12)
            );
        }

        $data['end'] = array(
            'end',
            1 => 0,                                      // Дополнительная скидка суммой  на весь итог чека
            2 => 0,                                      // оплата видом 1 (обычно это наличные)
            3 => 0,                                      // оплата видом 2 (обычно это кредит(Безнал)) (Без расчета сдачи)
            4 => $items->sum('total_price'),             // оплата видом 3 (Без расчета сдачи)
            5 => 0,                                      // оплата видом 4 (Без расчета сдачи)
            6 => 1,                                      // признак отрезать чек (1) или нет (0)
            7 => 1,                                      // на сколько строк протянуть ленту перед отрезкой
            8 => 0                                       // Авансовая сумма предоплаты
        );

        $receipt_data = implode(';', $data['head']) . ";\r\n";
        foreach ($data['str'] as $row) {
            $receipt_data .= implode(';', $row) . ";\r\n";
        }
        $receipt_data .= implode(';', $data['end']) . ";\r\n";

        $nc_core = nc_core::get_object();
        $folder = $nc_core->FILES_FOLDER . 'checks';
        if (!is_dir($folder)) {
            mkdir($folder, $nc_core->DIRCHMOD, true);
        }
        $file = $folder . '/check' . $receipt_id . '.txt';
        if ($nc_core->NC_UNICODE) {
            $receipt_data_1251 = $nc_core->utf8->utf2win($receipt_data);
        } else {
            $receipt_data_1251 = $receipt_data;
        }
        file_put_contents($file, $receipt_data_1251);

        $receipt->save_status(
            $receipt::STATUS_PENDING,
            array(
                'file' => $file,
                'size' => filesize($file),
                'data' => $receipt_data,
            )
        );

        // @todo обратная связь (см. «Описание механизма обратной связи после печати чеков»)
    }

}

/* 
 * head - заголовок чека
    [1]НомерЧека, 
    [2]ТипЧека(Продажа=0,Возврат Продажи=2), 
    [3]ДанныеКлиента( e-mail или номер телефона, данные будут отправляться посредством средств ОФД-оператора), 
    [4]РежимИнтернетМагазина(1-Не печатать чек(Признак отрезки указывайте=0, 0-Печатать чек))
    [5]Наименование клиента(строковая переменная, используется в макете)
    [6]ИНН клиента (числовая переменная, используется в макете)
    [7]КПП клиента (числовая переменная, используется в макете)
    [8]Пароль оператора (числовая переменная, используется в макете)
    [9]Код налогооблажения (числовая переменная от 1 до 6)
        1 Основная 
        2 Упрощенная система налогообложения доход 
        3 Упрощенная система налогообложения доход минус расход 
        4 Единый налог на вмененный доход 
        5 Единый сельскохозяйственный налог 
        6 Патентная система налогообложения 

 * str - строка чека:
    [1]Наименование товара(не  использовать символы «;» и «%», количество символов не больше 128), 
    [2]Количество (Пример: «2.2232», «167», дробная часть ), 
    [3]Цена,( 1 по умолчанию, зарезервировано), 
    [4]Секция,(Номер секции, (0..16 - режим свободной продажи, 255 - режим продажи по коду товара))
    [5]Соответствие налога в ККМ (1= - НДС18%, 2 - 10%),
    [6]Суммовая скидка –суммовая сидка  по данной позиции(<0-скидка, >0 надбавка), 
    [7]СуммаПоПозиции - это сумма до расчета скидки, 
    [8]Штрихкод – числовое выражение(символы от 0 до 9),
    [9]Признак способа расчета – числовое выражение(символы от 1 до 7),
        1. Предоплата 100%
        2. Частичная предоплата
        3. Аванс
        4. Полный расчет
        5. Частичный расчет и кредит
        6. Передача в кредит
        7. Оплата кредита
    [10]Признак предмета расчета – числовое выражение(символы от 1 до 12),
        1. Товар
        2. Подакцизный товар
        3. Работа
        4. Услуга
        5. Ставка азартной игры
        6. Выигрыш азартной игры
        7. Лотерейный билет
        8. Выигрыш лотереи
        9. Предоставление РИД
        10. Платеж
        11. Составной предмет расчета
        12. Иной предмет расчета
 
 * end- конец чека: 
    [1] Дополнительная скидка суммой  на весь итог чека, 
    [2]оплата видом 1(обычно это наличные), 
    [3]оплата видом 2(обычно это кредит(Безнал))(Без расчета сдачи), 
    [4]оплата видом 3(Без расчета сдачи), 
    [5]оплата видом 4(Без расчета сдачи), 
    [6]признак отрезать чек(1) или нет(0),
    [7] на сколько строк протянуть ленту перед отрезкой,
    [8]Авансовая сумма предоплаты.
 
 * пример: 
    head;12;0;Test@mail.ru;0;;;;
    str;товар;1;10;1;1;0;10;0;4;1;
    end;0;25;0;0;0;1;1;
 */ 
