<?php

class nc_netshop_location_data extends nc_record {

    protected $properties = array(
        'provider' => null, // класс, предоставивший данные
        'locality_id' => null, // внутренний ID населённого пункта (опционально, только для использования внутри класса nc_netshop_location_provider)
        'country_name' => null, // название страны
        'country_numeric_code' => null, // числовой код ISO-3166-1
        'region_name' => null, // название региона/области
        'district_name' => null, // название района
        'locality_name' => null, // название населённого пункта
        'name' => null, // однозначное название в пределах страны (может содержать название области, района)
                        // например: "Иваново, Псковская область, Невельский район" или "Иваново, Московская область"
        'latitude' => null, // широта [центра населённого пункта] в градусах в виде десятичной дроби
        'longitude' => null, // долгота
        'is_suffix_allowed' => false, // можно дописать что-то к названию и оно останется валидным (адреса за пределами РФ)
        'is_exact_match' => false, // полное совпадение со строкой поиска
        'weight' => 0, // вес для сортировки — более точные совпадения должны иметь больший вес (сейчас используется
                       // только внутри nc_netshop_location_provider, порядок результатов от разных классов определяется
                       // порядком, в котором они заданы)
    );

}